Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: and rebuild the interpreter by running :program:`make` in the toplevel directory. You can also run :program:`make` in the :file:`Modules/` subdirectory, but then you must first rebuild :file:`Makefile` there by running ':program:`make` Makefile'. (This is necessary each time you change the :file:`Setup` file.)
pl: i przebuduj program interpretujący przez uruchomienie programu :program:`make` w katalogu głównym instalacji. Możesz także uruchomić program :program:`make` w podkatalogu :file:`Modules/`, ale wtedy musisz najpierw przebudować plik :file:`Makefile` tam przez uruchomienie programu :program:`make` Makefile'. To jest konieczne za każdym razem gdy zmieniasz plik :file:`Setup`.)

source: If your module requires additional libraries to link with, these can be listed on the line in the configuration file as well, for instance::
pl: Jeśli twój moduł wymaga dodatkowych bibliotek do podłączenia, te mogą być wymienione na liście w kolejce do pliku konfiguracyjnego na przykład::

source: Calling Python Functions from C
pl: Wywoływanie zadań języka pytonowskiego z C

source: So far we have concentrated on making C functions callable from Python. The reverse is also useful: calling Python functions from C. This is especially the case for libraries that support so-called "callback" functions. If a C interface makes use of callbacks, the equivalent Python often needs to provide a callback mechanism to the Python programmer; the implementation will require calling the Python callback functions from a C callback. Other uses are also imaginable.
pl: Jak do tej pory koncentrowaliśmy się na uczynieniu zadań C możliwymi do wywołania z poziomu języka pytonowskiego. Odwrotna sytuacja jest także użyteczna: wywoływanie zadań języka pytonowskiego z poziomu języka C. To w szczególności odnosi się do bibliotek które wspierają tak zwane zadania "callback" wstecznie wywołujące. Jeśli sprzęg C używa zadań wstecznie wywołujących, odpowiednik języka pytonowskiego często potrzebuje dostarczyć mechanizm wstecznego wywołania dla programisty języka pytonowskiego; wypełnienie będzie potrzebowało wzywać zadania wywołania wstecznego z poziomu wstecznego C. Inne przypadki są także możliwe do wyobrażenia.

source: Fortunately, the Python interpreter is easily called recursively, and there is a standard interface to call a Python function. (I won't dwell on how to call the Python parser with a particular string as input --- if you're interested, have a look at the implementation of the :option:`-c` command line option in :file:`Modules/main.c` from the Python source code.)
pl: Szczęśliwie, program interpretujący polecenia języka pytonowskiego jest łatwo wywoływany rekursywnie i istnieje standardowy sprzęg aby wywołać zadanie języka pytonowskiego. (Nie będę rozpisywał się o tym jak wywołać czytnik języka pytonowskiego z konkretnym ciągiem znaków na wejściu --- jeśli jesteś zainteresowany, spójrz na wypełnienie opcji :option:`-c` wiersza polecenia w :file:`Modules/main.c` z kodu źródłowego języka pytonowskiego.)

source: Calling a Python function is easy. First, the Python program must somehow pass you the Python function object. You should provide a function (or some other interface) to do this. When this function is called, save a pointer to the Python function object (be careful to :cfunc:`Py_INCREF` it!) in a global variable --- or wherever you see fit. For example, the following function might be part of a module definition::
pl: Wywołanie zadania języka pytonowskiego jest łatwe. Po pierwsze program języka pytonowskiego musi jakoś przekazać ci przedmiot zadania języka pytonowskiego. Powinieneś dostarczyć zadanie (lub jakiś inny sprzęg) aby to uczynić. Gdy to zadanie jest wzywane, zachowaj wskaźnik do przedmiotu zadania języka pytonowskiego (uważaj aby zwiększyć ilość odniesień do niego :cfunc:`Py_INCREF`) w nadrzędnej zmiennej --- lub gdziekolwiek uznasz to za stosowne. Dla przykładu, następujące zadanie może być częścią definicji modułu::

source: static PyObject *my_callback = NULL; static PyObject * my_set_callback(PyObject *dummy, PyObject *args) { PyObject *result = NULL; PyObject *temp; if (PyArg_ParseTuple(args, "O:set_callback", &temp)) { if (!PyCallable_Check(temp)) { PyErr_SetString(PyExc_TypeError, "parameter must be callable"); return NULL; } Py_XINCREF(temp); /* Add a reference to new callback */ Py_XDECREF(my_callback); /* Dispose of previous callback */ my_callback = temp; /* Remember new callback */ /* Boilerplate to return "None" */ Py_INCREF(Py_None); result = Py_None; } return result; }
pl: static PyObject *my_callback = NULL; static PyObject * my_set_callback(PyObject *dummy, PyObject *args) { PyObject *result = NULL; PyObject *temp; if (PyArg_ParseTuple(args, "O:set_callback", &temp)) { if (!PyCallable_Check(temp)) { PyErr_SetString(PyExc_TypeError, "parametr musi być możliwy do wywołania"); return NULL; } Py_XINCREF(temp); /* Dodaj odniesienie do nowego wstecznie wywoływanego zadania */ Py_XDECREF(my_callback); /* Pozbądź się poprzedniego wstecznie wywołanego zadania */ my_callback = temp; /* Zapamiętaj nowe wstecznie wywoływane zadanie */ /* talerzowanie aby zwrócić "None" */ Py_INCREF(Py_None); result = Py_None; } return result; }

source: This function must be registered with the interpreter using the :const:`METH_VARARGS` flag; this is described in section :ref:`methodtable`. The :cfunc:`PyArg_ParseTuple` function and its arguments are documented in section :ref:`parsetuple`.
pl: To zadanie musi być zarejestrowane w programie interpretującym polecenia języka pytonowskiego używając flagi :const:`METH_VARARGS`; to jest opisane w rozdziale :ref:`methodtable` - :ref:`tabeli sposobów postępowania`. Zadanie :cfunc:`PyArg_ParseTuple` i jego parametry są dokumentowane w rozdziale :ref:`parsetuple` - ref:`wczytaj_dwójkę`.

source: The macros :cfunc:`Py_XINCREF` and :cfunc:`Py_XDECREF` increment/decrement the reference count of an object and are safe in the presence of *NULL* pointers (but note that *temp* will not be *NULL* in this context). More info on them in section :ref:`refcounts`.
pl: Makropolecenia :cfunc:`Py_XINCREF` i :cfunc:`Py_XDECREF` zwiększają/zmniejszają liczbę odniesień przedmiotu i są bezpieczne w obliczu pustych wskaźników *NULL* (ale zwróc uwagę, że *temp* nie będzie pusty - *NULL* w tym kontekście). Więcej informacji na ten temat znajdziesz w sekcji :ref:`refcounts` - :ref:`zliczaniaodniesień`.

source: Later, when it is time to call the function, you call the C function :cfunc:`PyObject_CallObject`. This function has two arguments, both pointers to arbitrary Python objects: the Python function, and the argument list. The argument list must always be a tuple object, whose length is the number of arguments. To call the Python function with no arguments, pass in NULL, or an empty tuple; to call it with one argument, pass a singleton tuple. :cfunc:`Py_BuildValue` returns a tuple when its format string consists of zero or more format codes between parentheses. For example::
pl: Później gdy nadchodzi czas aby wywołać zadanie, wywołujesz zadanie C :cfunc:`PyObject_CallObject`. To zadanie ma dwa parametry, oba wskaźniki do dowolnych przedmiotów języka pytonowskiego: zadania pytonowskiego i listy parametrów. Lista parametrów musi zawsze być przedmiotem krotki, której długością jest liczba parametrów. Aby wywołać zadanie języka pytonowskiego bez parametrów, przekaż NULL, lub pustą krotkę; aby wywołać je z jednym parametrem przekaż głupią krotkę. :cfunc:`Py_BuildValue` zwraca krotkę gdy jego ciąg znaków formatujących składa się z zera lub więcej kodów formatujących pomiędzy nawiasami. Dla przykładu::

source: int arg; PyObject *arglist; PyObject *result; ... arg = 123; ... /* Time to call the callback */ arglist = Py_BuildValue("(i)", arg); result = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist);
pl: int arg; PyObject *arglist; PyObject *result; ... arg = 123; ... /* Czas wywołać zadanie wstecznie */ arglist = Py_BuildValue("(i)", arg); result = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist);

source: :cfunc:`PyObject_CallObject` returns a Python object pointer: this is the return value of the Python function. :cfunc:`PyObject_CallObject` is "reference-count-neutral" with respect to its arguments. In the example a new tuple was created to serve as the argument list, which is :cfunc:`Py_DECREF`\ -ed immediately after the call.
pl: :cfunc:`PyObject_CallObject` zwraca wskaźnik przedmiotowy języka pytonowskiego: to jest wartość zwracana zadania języka pytonowskiego. :cfunc:`PyObject_CallObject` jest "neutralne-pod-względem-zliczania-odniesień" względem jego parametrów. W przykładzie nowa krotka została utworzona aby służyć jako lista parametrów, której liczba odniesień jest zmniejszona (:cfunc:`Py_DECREF`) od razu po wywołaniu.

source: The return value of :cfunc:`PyObject_CallObject` is "new": either it is a brand new object, or it is an existing object whose reference count has been incremented. So, unless you want to save it in a global variable, you should somehow :cfunc:`Py_DECREF` the result, even (especially!) if you are not interested in its value.
pl: Wartość zwracana :cfunc:`PyObject_CallObject` jest "nowa": albo jest to zupełnie nowy przedmiot, albo jest to istniejący przedmiot którego liczba odniesień została zwiększona. Więc, z wyjątkiem sytuacji gdy chcesz zachować ją w globalnej zmiennej, powinieneś jakoś zmniejszyć liczbę odniesień :cfunc:`Py_DECREF` rezultat, nawet (szczególnie!) jeśli nie jesteś zainteresowany jego wartością.

source: Before you do this, however, it is important to check that the return value isn't *NULL*. If it is, the Python function terminated by raising an exception. If the C code that called :cfunc:`PyObject_CallObject` is called from Python, it should now return an error indication to its Python caller, so the interpreter can print a stack trace, or the calling Python code can handle the exception. If this is not possible or desirable, the exception should be cleared by calling :cfunc:`PyErr_Clear`. For example::
pl: Zanim to zrobisz, jednakże, jest istotne aby sprawdzić czy wartość zwracana nie jest pusta - *NULL*. Jeśli jest, zadanie języka pytonowskiego zakończyło się przez wzniesienie wyjątku. Jeśli kod w języku C który wywołał :cfunc:`PyObject_CallObject` jest wywoływany z języka pytonowskiego, powinien teraz zwrócić błąd do swojego wywołującego z poziomu języka pytonowskiego, tak by program interpretujący polecenia języka pytonowskiego mógł wypisać ostatnie wywołania ze stosu, lub wywołanie kodu języak pytonowskiego mogło obsłużyć wyjątek. Jeśli nie jest to możliwe albo nie jest pożądane, wyjątek powinien zostać wyczyszczony przez wywołanie :cfunc:`PyErr_Clear`. Dla przykładu::

source: if (result == NULL) return NULL; /* Pass error back */ ...use result... Py_DECREF(result);
pl: if (result == NULL) return NULL; /* Przakaź błąd wstecz */ ...użyj wyniku... Py_DECREF(result);

source: Depending on the desired interface to the Python callback function, you may also have to provide an argument list to :cfunc:`PyObject_CallObject`. In some cases the argument list is also provided by the Python program, through the same interface that specified the callback function. It can then be saved and used in the same manner as the function object. In other cases, you may have to construct a new tuple to pass as the argument list. The simplest way to do this is to call :cfunc:`Py_BuildValue`. For example, if you want to pass an integral event code, you might use the following code::
pl: W zależności od oczekiwanego sprzęgu do wywoływanego wstecznie zadania, możesz także potrzebować dostarczyć listę parametrów do zadania :cfunc:`PyObject_CallObject`. W niektórych przypadkach lista parametrów jest także dostarczana przez program języka pytonowskiego, przez ten sam sprzęg który określał zadanie wywołania wstecznego. Może potem być zachowane i użyte w ten sam sposób jak przedmiot zadania. W innych przypadkach może być konieczne stworzenie nowej krotki aby przekazać ją jako listę parametrów. Najprostszym sposobem aby tego dokonać jest wywołanie :cfunc:`PyBuildValue`. Dla przykładu, jeśli chcesz przekazać wewnętrzny kod zdarzenia możesz użyć następującego kodu::

source: PyObject *arglist; ... arglist = Py_BuildValue("(l)", eventcode); result = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist); if (result == NULL) return NULL; /* Pass error back */ /* Here maybe use the result */ Py_DECREF(result);
pl: PyObject *arglist; ... arglist = Py_BuildValue("(l)", eventcode); result = PyObject_CallObject(my_callback, arglist); Py_DECREF(arglist); if (result == NULL) return NULL; /* Przekaż błąd wstecz */ /* Tutaj być może użycie wyniku */ Py_DECREF(result);

source: Note the placement of ``Py_DECREF(arglist)`` immediately after the call, before the error check! Also note that strictly speaking this code is not complete: :cfunc:`Py_BuildValue` may run out of memory, and this should be checked.
pl: Zauważ położenie ``Py_DECREF(arglist)`` bezpośrednio po wywołaniu, przed sprawdzeniem błędu! Zauważ też że ściśle mówiąc ten kod jest nie pełny: dla zadania :cfunc:`Py_BuildValue` może skończyć się pamięć, i to powinno zostać sprawdzone.

source: You may also call a function with keyword arguments by using :cfunc:`PyObject_Call`, which supports arguments and keyword arguments. As in the above example, we use :cfunc:`Py_BuildValue` to construct the dictionary. ::
pl: Możesz także wywołać zadanie z parametrami kluczowymi przez użycie :cfunc:`PyObject_Call`, które wspiera parametry i parametry słów kluczowych. Jak w powyższym przykładzie, używamy zadania :cfunc:`Py_BuildValue` aby zbudować słownik. ::

source: PyObject *dict; ... dict = Py_BuildValue("{s:i}", "name", val); result = PyObject_Call(my_callback, NULL, dict); Py_DECREF(dict); if (result == NULL) return NULL; /* Pass error back */ /* Here maybe use the result */ Py_DECREF(result);
pl: PyObject *dict; ... dict = Py_BuildValue("{s:i}", "name", val); result = PyObject_Call(my_callback, NULL, dict); Py_DECREF(dict); if (result == NULL) return NULL; /* Przekaż błąd wstecz */ /* Tutaj być może użyj wyniku */ Py_DECREF(result);

source: Extracting Parameters in Extension Functions
pl: Wydobywanie parametrów w zadaniach rozszerzających

source: The :cfunc:`PyArg_ParseTuple` function is declared as follows::
pl: Zadanie :cfunc:`PyArg_ParseTuple` jest zadeklarowane jak następuje::

source: The *arg* argument must be a tuple object containing an argument list passed from Python to a C function. The *format* argument must be a format string, whose syntax is explained in :ref:`arg-parsing` in the Python/C API Reference Manual. The remaining arguments must be addresses of variables whose type is determined by the format string.
pl: Parametr *arg* musi być przedmiotem - krotką zawierającym listę parametrów z języka pytonowskiego dla zadania C. Parametr *format* musi być ciągiem formatu, którego składnia jest wyjaśniona w :ref:`wczytywanie-parametrów` - :ref:`arg-parsing` w podręczniku użytkownika sprzęgów języka pytonowskiego/C. Pozostałe parametry muszą być adresami zmiennych których rodzaj jest określony przez ciąg formatujący.

source: Note that while :cfunc:`PyArg_ParseTuple` checks that the Python arguments have the required types, it cannot check the validity of the addresses of C variables passed to the call: if you make mistakes there, your code will probably crash or at least overwrite random bits in memory. So be careful!
pl: Zauważ, że podczas gdy :cfunc:`PyArg_ParseTuple` sprawdza, że parametry języka pytonowskiego mają wymagane rodzaje, nie może sprawdzić ważności adresów zmiennych C przekazywanych do wywołania: jeśli popełnisz tu błędy, twój kod prawdopodobnie wykona niedozwoloną operację lub przynajmniej zapisze przypadkowe pola w pamięci. Więc bądź ostrożny!

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
pl: Zauważ, że dowolne odniesienia do przedmiotów języka pytonowskiego, które są dostarczone wołającemu są *pożyczonymi* odniesieniami; nie zmniejszaj liczby tych odniesień.

source: Some example calls::
pl: Pewne przykładowe wywołania::

source: #define PY_SSIZE_T_CLEAN /* Make "s#" use Py_ssize_t rather than int. */ #include <Python.h>
pl: #define PY_SSIZE_T_CLEAN /* zrób "s#" użytek z Py_ssize_t raczej zamiast int. */ #include <Python.h>

source: int ok; int i, j; long k, l; const char *s; Py_ssize_t size; ok = PyArg_ParseTuple(args, ""); /* No arguments */ /* Python call: f() */
pl: int ok; int i, j; long k, l; const char *s; Py_ssize_t size; ok = PyArg_ParseTuple(args, ""); /* Żadnych parametrów */ /* Wywołanie pytonowskie: f() */

source: ok = PyArg_ParseTuple(args, "s", &s); /* A string */ /* Possible Python call: f('whoops!') */
pl: ok = PyArg_ParseTuple(args, "s", &s); /* Ciąg znaków */ /* Możliwe wywołanie pytonowskie: f('whoops!') */

source: ok = PyArg_ParseTuple(args, "lls", &k, &l, &s); /* Two longs and a string */ /* Possible Python call: f(1, 2, 'three') */
pl: ok = PyArg_ParseTuple(args, "lls", &k, &l, &s); /* Dwie liczby długie i ciąg znaków */ /* Możliwe wywołanie pytonowskie: f(1, 2, 'three') */

source: ok = PyArg_ParseTuple(args, "(ii)s#", &i, &j, &s, &size); /* A pair of ints and a string, whose size is also returned */ /* Possible Python call: f((1, 2), 'three') */
pl: ok = PyArg_ParseTuple(args, "(ii)s#", &i, &j, &s, &size); /* Para liczb całkowitych i ciąg znaków, którego rozmiar jest także zwracany */ /* Możliwe wywołanie pytonowskie: f((1, 2), 'three') */

source: { const char *file; const char *mode = "r"; int bufsize = 0; ok = PyArg_ParseTuple(args, "s|si", &file, &mode, &bufsize); /* A string, and optionally another string and an integer */ /* Possible Python calls: f('spam') f('spam', 'w') f('spam', 'wb', 100000) */ }
pl: { const char *file; const char *mode = "r"; int bufsize = 0; ok = PyArg_ParseTuple(args, "s|si", &file, &mode, &bufsize); /* Ciąg znaków, i opcjonalnie następny ciąg i liczba całkowita */ /* Możliwe wywołania pytonowskie: f('spam') f('spam', 'w') f('spam', 'wb', 100000) */ }

source: { int left, top, right, bottom, h, v; ok = PyArg_ParseTuple(args, "((ii)(ii))(ii)", &left, &top, &right, &bottom, &h, &v); /* A rectangle and a point */ /* Possible Python call: f(((0, 0), (400, 300)), (10, 10)) */ }
pl: { int left, top, right, bottom, h, v; ok = PyArg_ParseTuple(args, "((ii)(ii))(ii)", &left, &top, &right, &bottom, &h, &v); /* Prostokąt i punkt */ /* Możliwe wywołania pytonowskie: f(((0, 0), (400, 300)), (10, 10)) */ }

source: { Py_complex c; ok = PyArg_ParseTuple(args, "D:myfunction", &c); /* a complex, also providing a function name for errors */ /* Possible Python call: myfunction(1+2j) */ }
pl: { Py_complex c; ok = PyArg_ParseTuple(args, "D:myfunction", &c); /* Zespolona, także dostarczająca nazwę zadania dla błędów */ /* Możliwe wywołania pytonowskie: myfunction(1+2j) */ }

source: Keyword Parameters for Extension Functions
pl: Parametry kluczowe dla zadań rozszerzających

source: The :cfunc:`PyArg_ParseTupleAndKeywords` function is declared as follows::
pl: Zadanie :cfunc:`PyArg_ParseTupleAndKeywords` jest zadeklarowane jak następuje::

source: The *arg* and *format* parameters are identical to those of the :cfunc:`PyArg_ParseTuple` function. The *kwdict* parameter is the dictionary of keywords received as the third parameter from the Python runtime. The *kwlist* parameter is a *NULL*-terminated list of strings which identify the parameters; the names are matched with the type information from *format* from left to right. On success, :cfunc:`PyArg_ParseTupleAndKeywords` returns true, otherwise it returns false and raises an appropriate exception.
pl: Parametry *arg* i *format* są identyczne z tymi z zadania :cfunc:`PyArg_ParseTuple`. Parametr *kwdict* jest słownikiem słów kluczowych otrzymywanych jako trzeci parametr w czasie wykonania. Parametr *kwlist* jest zakończoną znakiem *NULL* listą ciągów znaków które identyfikują parametry; Nazwy są dopasowywane z typem informacji z *formatu* od lewej do prawej. Przy pomyślnym rozwiązaniu zadanie :cfunc:`PyArg_ParseTupleAndKeywords` zwraca prawdę, w innym przypadku zwraca fałsz i zgłasza odpowiedni wyjątek.

source: Nested tuples cannot be parsed when using keyword arguments! Keyword parameters passed in which are not present in the *kwlist* will cause :exc:`TypeError` to be raised.
pl: Zagnieżdźone krotki nie mogą być wczytane gdy używane są parametry słów kluczowych! Parametry słów kluczowych przekazane do zadania które nie są obecne na liście *kwlist* spowodują że wyjątek :exc:`TypeError` zostanie zgłoszony.

source: Here is an example module which uses keywords, based on an example by Geoff Philbrick (philbrick@hks.com)::
pl: Tu jest przykładowy moduł który używa słów kluczowych, oparty na przykładzie Geoffa Philbricka (philbrick@hks.com)::

source: #include "Python.h" static PyObject * keywdarg_parrot(PyObject *self, PyObject *args, PyObject *keywds) { int voltage; char *state = "a stiff"; char *action = "voom"; char *type = "Norwegian Blue"; static char *kwlist[] = {"voltage", "state", "action", "type", NULL}; if (!PyArg_ParseTupleAndKeywords(args, keywds, "i|sss", kwlist, &voltage, &state, &action, &type)) return NULL; printf("-- This parrot wouldn't %s if you put %i Volts through it.\n", action, voltage); printf("-- Lovely plumage, the %s -- It's %s!\n", type, state); Py_INCREF(Py_None); return Py_None; } static PyMethodDef keywdarg_methods[] = { /* The cast of the function is necessary since PyCFunction values * only take two PyObject* parameters, and keywdarg_parrot() takes * three. */ {"parrot", (PyCFunction)keywdarg_parrot, METH_VARARGS | METH_KEYWORDS, "Print a lovely skit to standard output."}, {NULL, NULL, 0, NULL} /* sentinel */ };
pl: #include "Python.h" static PyObject * keywdarg_parrot(PyObject *self, PyObject *args, PyObject *keywds) { int napiecie; char *stan = "sztywna"; char *akcja = "wyje"; char *typ = "Norweska Niebieska"; static char *kwlist[] = {"napiecie", "stan", "akcja", "typ", NULL}; if (!PyArg_ParseTupleAndKeywords(args, keywds, "i|sss", kwlist, &napiecie, &stan, &akcja, &typ)) return NULL; printf("-- Ta papuga nie %s nawet jeśli przyłożysz %i Voltów do niej.\n", action, voltage); printf("-- Piękne ubarwienie, %s -- jest %s!\n", type, state); Py_INCREF(Py_None); return Py_None; } static PyMethodDef keywdarg_methods[] = { /* Rzutowanie zadania jest konieczne odkąd wartości PyCFunction * pobierają tylko dwa parametery PyObject* , i keywdarg_parrot() pobiera * trzy. */ {"parrot", (PyCFunction)keywdarg_parrot, METH_VARARGS | METH_KEYWORDS, "Wypisz ładny skecz na standardowe wyjście."}, {NULL, NULL, 0, NULL} /* ochroniarz */ };

source: void initkeywdarg(void) { /* Create the module and add the functions */ Py_InitModule("keywdarg", keywdarg_methods); }
pl: void initkeywdarg(void) { /* Stwórz moduł i dodaj zadania */ Py_InitModule("keywdarg", keywdarg_methods); }

source: Building Arbitrary Values
pl: Budowanie Dowolnych Wartości

source: This function is the counterpart to :cfunc:`PyArg_ParseTuple`. It is declared as follows::
pl: To zadanie jest odpowiednikiem :cfunc:`PyArg_ParseTuple`. Jest deklarowane w następujący sposób::
